Дошкольное_учреждение83/src/InformationRegisters/удуСвязьДокументовСДелопроизводством/удуСвязьДокументовСДелопроизводством.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>удуСвязьДокументовСДелопроизводством</name>
  <resources>
    <name>ВидДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДокументДОУ</name>
    <type>
      <types>DocumentRef.удуДоговорОЗачисленииРебенка</types>
      <types>CatalogRef.удуДокументыПропускаЗанятий</types>
      <types>DocumentRef.удуПриемНаРаботуВОрганизацию</types>
      <types>DocumentRef.удуВозвратНаРаботуОрганизаций</types>
      <types>DocumentRef.удуПеремещениеТМЦ</types>
      <types>DocumentRef.удуОприходованиеТМЦ</types>
      <types>DocumentRef.удуЗаявкаНаЗачислениеРебенкаВДОУ</types>
      <types>DocumentRef.удуПриказОЗачисленииРебенкаВГруппу</types>
      <types>DocumentRef.удуСписаниеТМЦ</types>
      <types>DocumentRef.удуПриказОВыбытииИзГруппы</types>
      <types>DocumentRef.удуУвольнениеИзОрганизаций</types>
      <types>DocumentRef.удуПриказОПереводеВДругуюГруппу</types>
      <types>DocumentRef.удуКадровоеПеремещениеОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументДелопроизводства</name>
    <type>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/Catalogs/удуДети/удуДети.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>удуДети</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>СтатусРебенка</name>
    <type>
      <types>EnumRef.удуСтатусРебенкаВДОУ</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.удуПол</types>
    </type>
  </attributes>
  <attributes>
    <name>Национальность</name>
    <type>
      <types>CatalogRef.удуНациональности</types>
    </type>
  </attributes>
  <attributes>
    <name>РоднойЯзык</name>
    <type>
      <types>CatalogRef.удуЯзыкиНародовМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерияСвидетельства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСвидетельства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачиСвидетельства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганВыдачиСвидетельства</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресМестаРождения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресМестаПроживания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоциальноеПоложение</name>
    <type>
      <types>CatalogRef.удуСоциальныеПоложения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖилищныеУсловия</name>
    <type>
      <types>CatalogRef.удуЖилищныеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>МатериальноеПоложение</name>
    <type>
      <types>CatalogRef.удуМатериальныеПоложения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеСоциальныеСведения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФотографияРебенка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Catalogs/ВнутренниеДокументы/ВнутренниеДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВнутренниеДокументы</name>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыВнутреннихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Дело</name>
    <type>
      <types>CatalogRef.ДелаХраненияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Зарегистрировал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛистов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПриложений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистовВПриложениях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Папка</name>
    <type>
      <types>CatalogRef.ПапкиВнутреннихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение подготовившего</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <comment>Плановый срок исполнения</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Утвердил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧисловойНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корреспондент</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>удуДержательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>удуРебенок</name>
    <type>
      <types>CatalogRef.удуДети</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>удуДети</name>
    <attributes>
      <name>Ребенок</name>
      <type>
        <types>CatalogRef.удуДети</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/CommonForms/удуФормаСвязиДокументаСДелопроизводством/Module.bsl
&НаСервере
Функция ПолучитьРебенкаДляОтбора(ДокументПараметр)
	Попытка
		Возврат ДокументПараметр.Ребенок;
	Исключение
		Попытка
			Возврат ДокументПараметр.Владелец;
		Исключение
			Возврат Справочники.удуДети.ПустаяСсылка();
		КонецПопытки;
	КонецПопытки;
КонецФункции

&НаСервере
Процедура СформироватьТаблицуДокументов()
	ТекстЗапроса = "ВЫБРАТЬ
	               |	удуСвязьДокументовСДелопроизводством.ДокументДелопроизводства,
	               |	удуСвязьДокументовСДелопроизводством.ВидДокумента,
	               |	удуСвязьДокументовСДелопроизводством.Комментарий
	               |ИЗ
	               |	РегистрСведений.удуСвязьДокументовСДелопроизводством КАК удуСвязьДокументовСДелопроизводством
	               |ГДЕ
	               |	удуСвязьДокументовСДелопроизводством.ДокументДОУ = &ДокументДОУ";
				   
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДокументДОУ", РеквизитДокументДОУ);
	
	сэРезультатВыполнения = Запрос.Выполнить().Выгрузить();	
    ЗначениеВРеквизитФормы(сэРезультатВыполнения, "РеквизитТаблицаСвязанныхДокументов");
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСодержимоеРегистраСведений()
	сэТаблицаДокументов = РеквизитФормыВЗначение("РеквизитТаблицаСвязанныхДокументов");
	Если ЗначениеЗаполнено(РеквизитДокументДОУ) Тогда 
		нзСвязьСДП = РегистрыСведений.удуСвязьДокументовСДелопроизводством.СоздатьНаборЗаписей();
		нзСвязьСДП.Отбор.ДокументДОУ.Установить(РеквизитДокументДОУ);
		
		Для Каждого СтрокаТаблицыДокументов Из сэТаблицаДокументов Цикл
			Если ЗначениеЗаполнено(СтрокаТаблицыДокументов.ВидДокумента) И ЗначениеЗаполнено(СтрокаТаблицыДокументов.ДокументДелопроизводства) Тогда
				НоваяЗаписьСвязьСДП = нзСвязьСДП.Добавить();
				НоваяЗаписьСвязьСДП.ДокументДОУ = РеквизитДокументДОУ;
				НоваяЗаписьСвязьСДП.ВидДокумента = СтрокаТаблицыДокументов.ВидДокумента;
				НоваяЗаписьСвязьСДП.ДокументДелопроизводства = СтрокаТаблицыДокументов.ДокументДелопроизводства;
			КонецЕсли;
		КонецЦикла;		
		
		нзСвязьСДП.Записать(Истина);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитДокументДОУОчистка(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РеквизитДокументДОУНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбновитьСодержимоеРегистраСведений();
КонецПроцедуры

&НаКлиенте
Процедура РеквизитТаблицаСвязанныхДокументовДокументДелопроизводстваНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Элементы.РеквизитТаблицаСвязанныхДокументов.ТекущиеДанные.ВидДокумента) Тогда
		СтрокаВидДокумента = СокрЛП(Элементы.РеквизитТаблицаСвязанныхДокументов.ТекущиеДанные.ВидДокумента);		
		Если СтрокаВидДокумента = "Внутренние документы" Тогда
			ФормаВыбораСправочника = ПолучитьФорму("Справочник.ВнутренниеДокументы.Форма.ФормаВыбора",, ЭтаФорма);
		ИначеЕсли СтрокаВидДокумента = "Входящие документы" Тогда
			ФормаВыбораСправочника = ПолучитьФорму("Справочник.ВходящиеДокументы.Форма.ФормаВыбора",, ЭтаФорма);
		ИначеЕсли СтрокаВидДокумента = "Исходящие документы" Тогда
			ФормаВыбораСправочника = ПолучитьФорму("Справочник.ИсходящиеДокументы.Форма.ФормаВыбора",, ЭтаФорма);
		КонецЕсли;		
		
		РебнокДляОтбора = ПолучитьРебенкаДляОтбора(РеквизитДокументДОУ);
		
		ЭлементОтбораПоРебенку = ФормаВыбораСправочника.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораПоРебенку.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбораПоРебенку.Использование = Истина;
		ЭлементОтбораПоРебенку.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("удуРебенок");
		ЭлементОтбораПоРебенку.ПравоеЗначение = РебнокДляОтбора;
		ЭлементОтбораПоРебенку.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		ВыбранныйДокумент = ФормаВыбораСправочника.ОткрытьМодально();
		
		Если ВыбранныйДокумент <> Неопределено Тогда
			Элементы.РеквизитТаблицаСвязанныхДокументов.ТекущиеДанные.ДокументДелопроизводства = ВыбранныйДокумент;
		КонецЕсли;		
	Иначе
		Вопрос("Сначала укажите вид документа!", РежимДиалогаВопрос.ОК);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СформироватьТаблицуДокументов();
КонецПроцедуры
